In [1]:
import pandas as pd

In [13]:
df=pd.read_csv(r"D:\Sorting Files\Demo files for reading using pandas\demo_files\file_1.csv")

df

    name  age    city
0    Ace   21   Delhi
1  Honey   22  Mumbai

In [34]:
df2=pd.read_json(r"D:\Sorting Files\Demo files for reading using pandas\demo_files\file_1.json")

df2

    name  age    city
0    Ace   21   Delhi
1  Honey   22  Mumbai

In [35]:
# df=pd.read_table(r"D:\Sorting Files\Demo files for reading using pandas\demo_files\file_1.txt" , sep =',')

# df

df3=pd.read_csv(r"D:\Sorting Files\Demo files for reading using pandas\demo_files\file_1.csv" , sep =',')

df3

    name  age    city
0    Ace   21   Delhi
1  Honey   22  Mumbai

In [36]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   city    2 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes

In [42]:
# df3.tail(1)
# df3['Rank']

In [44]:
df3.loc[0]

name      Ace
age        21
city    Delhi
Name: 0, dtype: object